soap_files/test_cases/addFuel_10.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://example.se.java.main.src.product/">
   <soapenv:Header/>
   <soapenv:Body>
      <exam:addFuel>
         <arg0>[TemplateProperty: Gallons]</arg0>
      </exam:addFuel>
   </soapenv:Body>
</soapenv:Envelope>
